// start1.cpp : 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

#define   ABS(x)        (((x)<0) ? -(x) : (x))
int main()
{
    int x;

    printf("안녕하세요. C++ 의 세계에 오신것을 환영합니다.야빠빠빠빠\n\n");
    printf("삼항 연산자 연습 %d", ABS(-5));
    return 0;
} //코 . 카 . 인 . 코카인 코코카인 코코코카카카인
  // 야 따따 야따따 도ㅗㄴ익천 이것에 빠지면 아빠팬더곰 OPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPOPO 비쥬얼 스트돌핳
  // 그래 그리 쉽지는 않겠지 나를 허락해준 세상이란 손쉽게 다가오는 뻔하고도 감미로운 공간이아냐 그래도 날아오를거야 작은날개짓에 꿈을담아 조금만기다려봐 오마이럽 뚜 루루뚜루루뚜루뚜루루룰ㄹㄹㄹㄹㄹㄹㄹㄹㄹㄹ
  // 나비처럼 날아가볼까 출렁거리는 바람에 실려 

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
